{"diagnostic": {"Suspected Adrenal Insufficiency": {"Primary Adrenal Insufficiency": [], "Secondary Adrenal Insufficiency": [], "Congenital Adrenal Hyperplasia": []}}, "knowledge": {"Suspected Adrenal Insufficiency": {"Risk Factors": "Autoimmune diseases; Genetic predisposition; Infections (e.g., tuberculosis, HIV); Adrenal hemorrhage; Anticoagulant therapy; Chronic use of glucocorticoids or other immunosuppressive drugs; Certain medications that affect adrenal function; etc.", "Symptoms": "Fatigue; Muscle weakness; Weight loss; Gastrointestinal symptoms (nausea, vomiting, diarrhea); Low blood sugar; Hyperpigmentation (in primary adrenal insufficiency); Various abnormal manifestations of skin;Changes in serum potassium levels; Salt craving; Dizziness or fainting upon standing; Low blood sugar levels; etc.", "Signs": "Hyperpigmentation (especially in creases of skin, on scars, or gums, in primary adrenal insufficiency); Low blood pressure; especially when standing (orthostatic hypotension); Dehydration; Abdominal tenderness; Electrolyte imbalances (hyponatremia, hyperkalemia); Rapid heart rate; etc."}, "Primary Adrenal Insufficiency": "1. Often there are high ACTH levels because the adrenal glands do not respond to ACTH \n ;2. Both PAI and SAI may present with hyporesponsiveness, but in PAI cortisol does not increase even when ACTH is given because the adrenal glands are damaged \n ;3. In PAI, imaging studies may show structural abnormalities in the adrenal glands.\n ;4. May be associated with significant electrolyte imbalances such as hyponatremia and hyperkalemia \n ;5. Aldosterone is usually not involved, so hyperkalemia is unlikely \n ;6 have Addison's disease. \n", "Secondary Adrenal Insufficiency": "1. ACTH levels are low or normal because the problem originates from the pituitary gland or hypothalamus, which does not secrete ACTH adequately.\n ;2. Cortisol increases when ACTH is given \n ;3 For SAI, an MRI or CT scan may be needed to evaluate the structure of the pituitary gland and hypothalamus .\n", "Congenital Adrenal Hyperplasia": "1.Hormone measurements in blood and urine, specifically 17 hydroxyprogesterone (17-OHP), cortisol, androgens, and aldosterone. ;2.Patients with CAH often present with abnormally elevated 17-OHP levels.; 3.ACTH stimulation test: Measures changes in 17-OHP levels before and after ACTH (adrenocorticotropic hormone) injection to evaluate adrenocortical function.;4. Genetic testing can confirm the diagnosis of CAH and identify the specific type of enzyme defect, the most common being 21-hydroxylase deficiency.\n"}}