{"diagnostic": {"Suspected Asthma": {"Asthma": {"Severe Asthma": [], "Allergic Asthma": [], "Non-Allergic Asthma": [], "Cough-Variant Asthma": [], "Asthma-COPD": []}}}, "knowledge": {"Suspected Asthma": {"Risk Factors": "Allergies; family history of asthma or allergies; occupational exposures; smoking or exposure to secondhand smoke; air pollution; frequent respiratory infections; etc.", "Symptoms": "Recurrent episodes of wheezing; breathlessness; chest tightness; blood-tinged sputum and coughing; particularly at night or early morning; Sometimes accompanied by hypertension.;etc.", "Signs": "Observable signs during a physical examination might include wheezing on auscultation, especially after exercise or during an acute episode;after giving medicine, patient still has different breathe sound; etc."}, "Asthma": "Spirometry: A significant improvement in FEV1 (Forced Expiratory Volume in 1 second) of more than 12% and 200 ml from baseline after administration of a bronchodilator confirms the reversibility of airflow obstruction.\nFractional Exhaled Nitric Oxide (FeNO): Elevated levels indicate eosinophilic inflammation, supporting the diagnosis of asthma.\nPeak Expiratory Flow Variability: Monitoring over time can show variability in lung function, supporting an asthma diagnosis.\nHyperreactivity tests :An abnormal result in non-specific bronchial hyperreactivity tests (e.g., methacholine challenge test) may also lead to a strong suspicion of asthma.\n", "Severe Asthma": "doesn't respond well to conventional treatments needs stronger treatments;family history can also increase the probability;  acute attack regularly and severe; persistent flow limitation, even after giving enough bronchodilators; often accompanied with obesity or anxiety and depression", "Allergic Asthma": "Triggered by allergens such as pollen, dust mites, or pet dander, etc.", "Non-Allergic Asthma": "Triggered by factors not related to allergies, like stress, exercise, illnesses, or cold air, etc.", "Cough-Variant Asthma": "long-lasting dry cough that is not accompanied by other typical asthma symptoms such as wheezing or difficulty breathing; diurnal variation of peak expiratory flow>20%; often accompanied by a marked irritating cough at night; bronchodilators are effective", "Asthma-COPD": "Features of both asthma and chronic obstructive pulmonary disease (COPD), with symptoms and airflow limitation that aren't fully reversible;lasting airflow limitation; the elder has obvious symptoms"}}