{"diagnostic": {"Suspected Cardiomyopathy": {"Dilated Cardiomyopathy": [], "Hypertrophic Cardiomyopathy": [], "Restrictive Cardiomyopathy": [], "Arrhythmogenic Right Ventricular Cardiomyopathy": []}}, "knowledge": {"Suspected Cardiomyopathy": {"Risk Factors": "Genetic predisposition; Long-standing high blood pressure; Viral infections; Alcohol and toxins; Metabolic disorders and nutritional deficiencie; etc.", "Symptoms": "Fatigue and weakness; Shortness of breath; Swelling of the legs and ankles; Arrhythmias; Chest pain; etc."}, "Dilated Cardiomyopathy": "Echocardiogram: Demonstrates enlargement of the left ventricle or both ventricles and reduced contractile function. Specific values include increased Left Ventricular End-Diastolic Diameter (LVEDD) and a Left Ventricular Ejection Fraction (LVEF) below the normal range (<50%).\n;ECG: May reveal signs of abnormal rhythms or ventricular enlargement.\n;MRI: Can further assess cardiac structure and function, confirming ventricular volume enlargement and myocardial mass increase.\nCardiac catheterization and endomyocardial biopsy: In certain cases, these may be necessary to determine the heart's pressures and pumping efficiency and to directly examine the heart muscle tissue.\n", "Hypertrophic Cardiomyopathy": "Echocardiogram: Increased thickness of the myocardial wall (typically >15mm) without any other cardiac disease that could explain the thickening.\n;MRI: Used for a detailed assessment of myocardial thickness and to detect areas of hypertrophy that might not be visible on an echocardiogram\n", "Restrictive Cardiomyopathy": "Echocardiogram: Shows normal or nearly normal ventricular sizes and wall thickness but abnormal ventricular filling and mitral inflow patterns indicative of restrictive filling.\n;MRI: Helps assess cardiac structure, particularly for any fibrosis or calcification of the myocardium and pericardium.\n;Cardiac catheterization: Measures intracardiac pressures, showing elevated pressures during mitral inflow, consistent with a typical restrictive filling pattern.\n", "Arrhythmogenic Right Ventricular Cardiomyopathy": "Echocardiogram: May reveal specific arrhythmias, T-wave inversions in right ventricular leads, and epsilon waves on the ECG\n;ECG: Shows enlargement and dysfunction of the right ventricle.\n;MRI: Visualizes fatty infiltration and/or scarring of the right ventricle.\n;Cardiac Biopsy: In some cases, can diagnose by detecting fat and fibrous tissue changes in the myocardium.\n"}}