{"diagnostic": {"Suspected Diabetes": {"Diabetes": {"Type I Diabetes": [], "Type II Diabetes": [], "Specific Types of Diabetes": [], "Gestational Diabetes Mellitus": []}}}, "knowledge": {"Suspected Diabetes": {"Risk Factors": "family history of diabetes; obesity or overweight; physical inactivity; high blood pressure; abnormal cholesterol levels; history of gestational diabetes; polycystic ovary syndrome; age greater than 45 years; certain racial or ethnic backgrounds; etc.", "Symptoms": "increased thirst; frequent urination; unexplained weight loss; increased hunger; blurry vision; numbness or tingling in the feet or hands; sores that do not heal; extreme fatigue; etc.", "Signs": "high fasting plasma glucose levels; elevated 2-hour plasma glucose levels during an oral glucose tolerance test; high A1C levels; presence of ketones in urine; rapid weight loss; acanthosis nigricans; etc."}, "Diabetes": "The definitive diagnosis of diabetes hinges on meeting one of the following criteria: a fasting plasma glucose (FPG) level of ≥126 mg/dL; a 2-hour glucose value of ≥200 mg/dL during an OGTT, or a random plasma glucose of ≥200 mg/dL in the presence of classic symptoms of hyperglycemia or hyperglycemic crisis.", "Type I Diabetes": "Type 1 diabetes often involves an autoimmune process, so the following autoimmune markers can be used to aid diagnosis: anti-islet cell antibodies (ICA) ;anti-glutamate decarboxylase antibodies (GADA); anti-insulin antibodies (IAA) ;anti-tyrosine phosphatase-related Antibodies (IA-2A);These antibodies are positive in most patients with type 1 diabetes but are usually absent in patients with type 2 diabetes. ", "Type II Diabetes": "Type 2 diabetes is often associated with insulin resistance and may involve testing for  Insulin levels and C-peptide levels: The diagnosis of type II diabetes should be determined according to the curve shape of the values of C-peptide release test and insulin release test in different states,for example,fasting,30min,60min,120min,180min. Able-bodied person:fasting basic plasma insulin is 5-20mlU/L,OGTT reached the peak value after 10min,and insulin returns to the basic level after 180 min;fasting C-peptide level was 1.1-4.4ng/ml,the secretion reached the peak which reaches 5-6 times of the basic value. Pre-diabetic patients:often in early stage type II diabetes, insulin levels may be normal or high. Classic type II diabetes:fasting insulin levels are normal or  above the  normal range.the peak is delayed after oral glucose,may reach the peak at 120min,but did not fall to the normal levels at 180min;fasting C-peptide level can be normal,high or low,the release curve rises slowly after taking sugar,the peak is delayed,and the release curve still does not fall back to the fasting level after 180 min. C-peptide testing can help evaluate the function of pancreatic beta cells and their ability to produce insulin.", "Specific Types of Diabetes": "Due to other conditions", "Gestational Diabetes Mellitus": "Diagnosed during pregnancy through glucose testing strategies that may include the OGTT"}}