{"diagnostic": {"Suspected Pituitary Disease": {"Pituitary Microadenomas": [], "Pituitary Macroadenomas": [], "Pituitary  Silent Adenomas ": []}}, "knowledge": {"Suspected Pituitary Disease": {"Risk Factors": "family history; Genetic syndromes (MEN1, MEN4, McCune-Albright syndrome; Carney complex; Familial Isolated Pituitary Adenoma); Age (30s-40s); Ethnic background (Ashkenazi Jewish descent); Sex (women more likely for certain adenomas); etc.", "Symptoms": "Typical: Headaches, Vision problems (blurred vision, double vision, loss of peripheral vision); Unexplained weight changes; Fatigue; Changes in menstrual cycle or sexual function; Increased growth in hands and feet (acromegaly); \n                                          High blood pressure; High or low blood sugar levels; Mood changes. Less typical: Facial numbness or pain; Dizziness; Loss of consciousness; Unexplained lactation; Feeling cold; Erectile dysfunction in men; Growth of breast tissue in men; Decreased interest in sex; etc.", "Signs": "Visual field defects; Features of hormonal excess (e.g., acromegaly signs, Cushingoid appearance); Pituitary apoplexy symptoms (sudden headache, vomiting, visual changes, possibly coma); etc."}, "Pituitary Microadenomas": "Pituitary adenomas that are less than 1 centimeter (10 millimeters) in size are called microadenomas. ; The gold standard diagnosis is through magnetic resonance imaging (MRI), which can accurately show the size and location of adenomas. ", "Pituitary Macroadenomas": "Pituitary adenomas that are 1 cm or larger in size are called macroadenomas. In addition to MRI, giant adenomas may also cause symptoms through their compression of surrounding structures, such as vision problems, in which case visual field testing is also required.", "Pituitary  Silent Adenomas ": "Nonfunctioning adenomas are pituitary adenomas that do not produce physiologically active levels of hormone, and they do not cause the clinical symptoms associated with hormone excess. Often discovered incidentally during MRI examinations, they are so-called incidentalomas"}}