{"diagnostic": {"Suspected Pulmonary Embolism": {"Pulmonary Embolism": {"Massive PE": [], "Submassive PE": [], "Low-risk PE": []}}}, "knowledge": {"Suspected Pulmonary Embolism": {"Risk Factors": "HTN; Previous VTE; Immobility or recent surgery; Cancer; Thrombophilia; Hormonal therapy (e.g., oral contraceptives or hormone replacement therapy); Pregnancy and the postpartum period; Obesity; Smoking; Long travel history.; etc.", "Symptoms": "Sudden onset of dyspnea; Chest pain (sharp and worsened with deep breaths); Hemoptysis; Syncope or dizziness; Tachypnea; Tachycardia; etc.", "Signs": "Tachypnea (rapid breathing); Tachycardia (rapid heart rate); Hypoxia (low oxygen levels in the blood); Cyanosis (blueish coloration of the skin and lips); Fever; Signs of deep vein thrombosis (DVT), such as swelling, redness, or pain in the leg.; etc."}, "Pulmonary Embolism": "Multi-slice spiral CT (CTPA): directly displays thrombus in the pulmonary artery.\nD-dimer test: This is a blood test in which high levels of D-dimer may indicate blood clots, but low levels can be used to rule out pulmonary embolism. Normal values for D-dimer should be lower, using age × 10 μg/L as the threshold\nEchocardiography: Assess right ventricular function and hemodynamics, especially important in high-risk patients. \n    Right ventricular dimensions: An enlarged right ventricle (RV) appears as increased width in cross-sectional long-axis view. Tricuspid annular plane \n    systolic excursion (TAPSE): If TAPSE is less than 16 mm, it indicates reduced RV function. \n    Tricuspid annular peak systolic velocity (S'): If the peak systolic velocity of the tricuspid annulus is less than 9.5 cm/sec, it may indicate RV insufficiency. \n    RV/LV diameter ratio: In the emergency setting, an RV to left ventricular (LV) diameter ratio greater than 1.0 can be used as an indicator of RV dysfunction. \n    RV wall thickness: During acute right ventricular pressure overload, echocardiography may detect increased RV wall thickness or tricuspid regurgitation ejection flow velocity exceeding 3.8 m/s or tricuspid peak systolic pressure gradient exceeding 60 mmHg.\nLower extremity venous ultrasound: Checks for the presence of deep vein thrombosis in the lower extremities, which may dislodge and become a pulmonary embolism.\nV/Q lung scan: compares the ventilation (V) and perfusion (Q) of the lungs to detect abnormal areas, which may indicate the presence of blood clots.\n", "Massive PE": "The patient develops hemodynamic instability, such as sustained hypotension, shock, or cardiac arrest. These patients are high-risk PE and require immediate thrombolytic treatment or surgical intervention.", "Submassive PE": "The patient is hemodynamically stable, but there is evidence of RV functional impairment, such as RV enlargement or ventricular septal deviation on echocardiography, and elevated blood biomarkers (such as cardiac troponin). These patients are intermediate-risk PE and require hospitalization and close monitoring to detect potential hemodynamic instability promptly.", "Low-risk PE": "The patient has stable hemodynamics, no evidence of RV function impairment, and normal blood biomarker levels. A low Pulmonary Embolism Severity Index (PESI) or simplified PESI (sPESI) score indicates a low risk of death."}}