{"diagnostic": {"Suspected Stroke": {"Ischemic Stroke": [], "Hemorrhagic Stroke": []}}, "knowledge": {"Suspected Stroke": {"Risk Factors": "hypertension; diabetes; cardiac history; smoking; hyperlipidemia; family history; atrial fibrillation; sedentary lifestyle; obesity; alcohol abuse; previous stroke or transient ischemic attack (TIA); high cholesterol; poor diet; age; gender; race; and certain medical conditions like sickle cell disease; etc.", "Symptoms": "sudden numbness or weakness in the face; arm, or leg, especially on one side of the body; confusion; trouble speaking or understanding speech; visual disturbances in one or both eyes; difficulty walking; dizziness; loss of balance or coordination; severe headache with no known cause; etc.", "Signs": "facial drooping; arm weakness; speech difficulties; vision problems; severe headache, dizziness or loss of balance; confusion, difficulty walking; numbness or paralysis on one side of the body, sudden behavioral change, and loss of consciousness"}, "Ischemic Stroke": "MRI Scan (especially the DWI sequence):\n    Positive DWI: Indicates ischemic damage to brain tissue at the time of scanning. On DWI, ischemic areas appear as high signal (bright white).\n    ADC Images: Accompanying DWI, this sequence shows low signal (dark areas) representing restricted movement of water molecules, characteristic of early ischemia.\nCT Scan:\n    Early ischemic changes: Within hours of an ischemic stroke, subtle loss of cerebral cortex and narrowing of brain sulci, referred to as \"sulcal effacement\", may be observed.\n    Low-density areas: Low-density areas in the brain parenchyma indicating ischemic tissue.\nCarotid and Intracranial Vessel Imaging:\n    Ultrasound: Carotid intima-media thickness ≥1.0 mm or visible plaque.\n    CTA/MRA: Demonstrating arterial stenosis of ≥50%.\n", "Hemorrhagic Stroke": "Non-contrast CT Scan:\n    High-density areas: Typical manifestation of hemorrhagic stroke on CT is a high-density area representing fresh bleeding. The density usually ranges from 50-80 Hounsfield Units (HU).\n    Hemorrhage volume: The volume and location of the bleed correlate closely with clinical manifestations; larger volumes generally have a poorer prognosis.\nMRI Scan:\n    T1 and T2 Weighted Imaging: Hemorrhage shows different signals on T1 and T2 sequences depending on the age of the bleed. Fresh bleeding may appear isointense or hypointense on T1 and hyperintense on T2.\n    Gradient Echo Sequence (GRE): Especially sensitive to blood breakdown products, such as deoxyhemoglobin and iron, used for detecting microbleeds.\nCerebral Angiography:\n    Detection of vascular abnormalities: Aneurysms, vascular malformations, or stenoses. Diagnosis of an aneurysm typically requires visualization of a typical \"saccular\" dilation.\n"}}