{"diagnostic": {"Suspected Thyroid Disease": {"Hypothyroidism": [], "Hyperthyroidism": [], "Thyroiditis": [], "Thyroid Nodules": {"Thyroid Cancer": []}}}, "knowledge": {"Suspected Thyroid Disease": {"Risk Factors": "Gender and Age; Both iodine deficiency and excess; Presence of thyroid autoantibodies ; Exposure to radiation; Family history of thyroid disease; Pregnancy itself alters thyroid function; Smoking; Certain Medications, e.g., Lithium, Amiodarone, Interferons, Rifampin, PTU, MMI, SSRIs", "Symptoms": "Hypothyroidism: Fatigue and sluggishness; Increased sensitivity to cold; Constipation; Dry skin and hair; Weight gain; Puffy face; Hoarseness; Muscle weakness; Elevated blood cholesterol level; Muscle aches, tenderness, and stiffness; Pain, stiffness, or swelling in your joints; Heavier than normal or irregular menstrual periods; Thinning hair; Slowed heart rate; Depression; Impaired memory; bradycardia; decrease in basal body temperature\n                                                        Hyperthyroidism: Sudden weight loss; Rapid heartbeat; Irregular heartbeat; Pounding of your heart; Increased appetite; Nervousness, anxiety, and irritability; Tremor — usually a fine trembling in your hands and fingers; Sweating; Changes in menstrual patterns; Increased sensitivity to heat; Changes in bowel patterns, especially more frequent bowel movements; An enlarged thyroid gland ; Fatigue, muscle weakness; Difficulty sleeping; Shortness of breath; Eye swelling and increased tearing\n                                                        Thyroiditis: Enlargement of the thyroid gland"}, "Hypothyroidism": {"Criteria": "TSH > 4.0-4.5 mIU/L ; Free T4 (FT4) below the normal range (0.9-1.7 ng/dL); FT3<2.0 pg/ml; T3<80 ng/dL; T4<5.0 ng/dL"}, "Hyperthyroidism": {"Criteria": "Low  TSH (<0.1 mIU/L) ; high levels of T4 (> 12.0 ng/dL) ;Triiodothyronine (T3) (> 180 ng/dL); FT4> 1.7 pg/ml; FT3 > 4.4 pg/ml"}, "Thyroiditis": {"Criteria": "Thyroid function tests and thyroid antibody tests (such as anti-thyroid peroxidase antibodies, TPOAb); ultrasound shows thyroid size and shape may appear enlarged or morphologically altered; Changes in Echogenicity  showing areas of hypoechoicity, indicating tissue heterogeneity; ultrasound imaging may show increased or abnormal blood flow; ultrasound  find thyroid tissue may display structural heterogeneity"}, "Thyroid Nodules": {"Criteria": "Thyroid ultrasound is the preferred method for evaluating thyroid nodules, which can help determine the nature of the nodules (likelihood of benign vs. malignant);\n\nEchogenicity：\n    Hypoechoic: The nodule appears darkerthan the surrounding thyroid tissue, which may suggest malignancy.\n    Isoechoic or Hyperechoic: The nodule appears similar to or brighter than surrounding tissue, usually indicating benignity.\n\nMargins:\n    Irregular margins: May indicate malignancy. \n    Smooth and well-defined margins: Typically indicate a benign nodule.\n\nShape:\n    Taller-than-wide: Nodules that are taller than they are wide (vertical to the skin) may be malignant.\n    Wider-than-tall: Nodules that are wider than they are tall (horizontal to the skin) are usually benign.\n\nMicrocalcifications:\n    Small calcium deposits within a nodule may suggest malignancy.\n\nBlood flow pattern:\n    Using Doppler ultrasound, increased abnormal blood flow may be associated with malignant nodules. \n\nFor suspicious nodules, fine-needle aspiration biopsy (FNA) is crucial for definitive diagnosis."}, "Thyroid Cancer": {"Criteria": " If FNA results suggest cancer or are suspicious for cancer, surgery, and further histopathological evaluation are usually necessary. Sufficient sample size is needed to make a diagnosis."}}}