{"diagnostic": {"Suspected Tuberculosis": {"LTBI": [], "Tuberculosis": []}}, "knowledge": {"Suspected Tuberculosis": {"Risk Factors": ": Close contact with someone with infectious TB、HIV infection; Areas with high TB prevalence (geographical risk factors);Immunosuppression (e.g., corticosteroid use, organ transplant); Previous history of TB or inadequately treated TB; Socioeconomic factors: homelessness, incarceration、Substance abuse: tobacco smoking, drug use、Health care workers with exposure to TB.; etc.", "Symptoms": "Typical: Persistent cough for more than three weeks; coughing up blood; chest pain; fever; night sweats; weight loss; fatigue. Less typical: Shortness of breath; lymphadenopathy; anorexia; etc.", "Signs": "More specific: Evidence of weight loss; fever; signs of pleural effusion on physical examination Less specific: Lymphadenopathy; signs of comorbid conditions (e.g., HIV infection signs).; etc."}, "LTBI": "Interferon-gamma release test (IGRA): This is a blood test that can detect whether there is an immune response to Mycobacterium tuberculosis in the body. It is not affected by BCG vaccination, so it is especially suitable in areas where BCG has been vaccinated.    \nTuberculin test (TST): Inject a certain amount of purified protein derivative (PPD) into the skin and observe the reaction of the skin 48 to 72 hours later to determine whether the patient is infected with Mycobacterium tuberculosis. Results need to be judged based on the size of the induration, usually 5 mm or larger is considered a positive reaction, but this also depends on the individual's specific circumstances such as HIV infection or recent exposure to a case of tuberculosis.\n", "Tuberculosis": "Sputum smear microscopy: This is a rapid test that uses a microscope to examine sputum samples for tuberculosis bacteria. Although simple and low-cost, it is less sensitive. \nSputum culture: This is the gold standard for diagnosing tuberculosis. The sputum sample is cultured in a specific medium to see if Mycobacterium tuberculosis is growing. Culture can provide information about resistance but takes a long time (usually weeks to months). \nMolecular biology detection methods: such as PCR technology, which can quickly detect the genetic material of Mycobacterium tuberculosis with high sensitivity and specificity, and is especially suitable for patients with negative sputum smear. \nChest X-ray: Chest X-ray is a commonly used screening tool for patients suspected of having active pulmonary tuberculosis, which can reveal abnormalities in the lungs, such as patchy shadows, cavities, etc.\n"}}